// розширення - додаткова функціональність, що вноситься до інших класів
// та доступна всім їх реалізаціям
export {}   // необхідно, щоб файл вважався модулем та оброблявся компілятором

declare global {             // в середині файлу всі оголошення - локальні
    interface Number {       // для зверення до глобального простору - declare global
        pad2: () => string,  // TS підтримує поєднання (merge) інтерфейсів - нові оголошення додаються до попередніх
    }
}

Number.prototype.pad2 = function():string {
    return this.valueOf().toFixed(2);
}